### Exercício 02 – Manipulando dados com Pandas
        a) Crie um programa em pandas para ler o arquivo em Excel imobiliária.xlsx
        b) e coloque em um dataframe.
        c) Visualize o cabeçalho dos dados;
        d) Visualize as últimas linhas;
        e) Escreva um programa para renomear o cabeçalho da tabela com os
        f) seguintes nomes:
        g) 5. Quais são os tipos de dados que temos no dataframe?
        h) 6. Há valores faltantes ou nulos?
        i) 7. Calcule a soma, média, máximo, mínimo e contagem da coluna Preço.
        j) 8. Crie um programa para criar um dataframe para mostrar as vendas por
        k) região, e salvar um arquivo em Excel para cada região.
            Centro
            Noroeste
            Norte
            Sudeste
            Oeste
            Leste
            Sudoeste
            Sul
            Nordeste
        l) Gere um arquivo em Excel para representar as vendas efetuadas pela filial norte em 2010.
        m) Gere um arquivo em Excel para representar as vendas efetuadas pela filial Sudeste em 2010. Sendo que no relatório deve conter apenas vendas de casas sem garagem.
        n) Qual o valor máximo de comissão que a imobiliária numa venda?
        o) Quantas casas de 2 ou 3 dormitórios foram vendidas pelo Ricardo antes de 2011.

In [2]:
import pandas as pd

caminho = ("C:\\Users\\FIC\\Documents\\gustavo-muniz-python\\Arquivos\\Imobiliária.xlsx")

df = pd.read_excel(caminho)

df.head()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [3]:
df.tail()

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
1112,Sudeste,Cristina,2011-03-19,Apartamento,87.5,2,0,Não,221500,3322.5
1113,Sudeste,Simone,2011-03-20,Apartamento,74.5,2,2,Não,224400,3366.0
1114,Norte,João Carlos,2011-03-21,Apartamento,192.0,4,4,Não,361000,5415.0
1115,Leste,Simone,2011-03-27,Apartamento,42.0,1,1,Sim,167900,2518.5
1116,Oeste,Simone,2011-03-28,Apartamento,100.5,2,2,Sim,227600,3414.0

In [9]:
df = df.rename(columns={
    'Coluna 1': 'Filial',
    'Coluna 2': 'Vendedor',
    'Coluna 3': 'Data',
    'Coluna 4': 'Tipo',
    'Coluna 5': 'Area (m2)',
    'Coluna 6': 'Dorms.',
    'Coluna 7': 'Garag.',
    'Coluna 8': 'Piscina',
    'Coluna 8.1': 'Preço',
    'Coluna 10': 'Comissão'

})

df.head()

,Filial,Vendedor,Data,Tipo,Area (m2),Dorms.,Garag.,Piscina,Preço,Comissão
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1117 entries, 0 to 1116
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Filial      1117 non-null   object
 1   Vendedor    1117 non-null   object
 2   Data        1117 non-null   datetime64[ns]
 3   Tipo        1117 non-null   object
 4   Area (m2)   1117 non-null   float64
 5   Dorms.      1117 non-null   int64
 6   Garag.      1117 non-null   int64
 7   Piscina     1117 non-null   object
 8   Coluna 8.1  1117 non-null   int64
 9   Comissão    1117 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 87.4+ KB

In [8]:
df.describe()

,Data,Area (m2),Dorms.,Garag.,Coluna 8.1,Comissão
count,1117,1117.000000,1117.000000,1117.000000,1117.000000,1117.000000
mean,2008-06-24 03:30:08.057296384,125.965085,2.523724,1.646374,264131.602507,3961.974038
min,2005-10-08 00:00:00,25.000000,1.000000,0.000000,145100.000000,2176.500000
25%,2007-01-29 00:00:00,82.000000,2.000000,1.000000,213500.000000,3202.500000
50%,2008-06-08 00:00:00,127.000000,3.000000,2.000000,284300.000000,4264.500000
75%,2009-11-30 00:00:00,169.500000,3.000000,3.000000,314700.000000,4720.500000
max,2011-03-28 00:00:00,245.000000,4.000000,4.000000,384300.000000,5764.500000
std,NaN,53.290147,1.106603,1.233972,77249.578385,1158.743676

### Funções do PANDAS

In [20]:
# df['Preço'].sum()

# df['Preço'].mean()

# df['Preço'].max()

# df['Preço'].min()

# df['Preço'].count()

# df['Preço'].std()

df['Preço'].sum()

295035000

In [15]:
df['Preço'].mean()

264131.6025067144

In [16]:
df['Preço'].max()

384300

In [17]:
df['Preço'].min()

145100

In [18]:
df['Preço'].count()

1117

In [28]:
df['Preço'].std()

77249.57838462107

### Filtrar dados em um DataFrame

##### df['coluna'] === condição 

        != Diferente
        == Igual
        >= Maior ou Igual
        <= Menor ou Igual
        > Maior
        < Menor

### Gerar um arquivo de saída

##### df.to_excel( caminho + nome do arquivo)

        to CSV
        to JSON
        to SQL

In [34]:
df_final = df[df['Filial'] == "Centro"]

In [35]:
caminho = "C:\\Users\\FIC\\Documents\\gustavo-muniz-python\\Relatório - Filiais\\"

arquivo = 'centro.xlsx'

df_final.to_excel(caminho + arquivo)